'''
IN PROGRESS! Нашел какую-то стороннюю библиотеку и забил.

Заменяем вводы на транслите на русские.
Вход: файл с вводами на транслите
Выход: файл с вводами на русском
'''

translit = input('Enter file with translits: ')
result = input('Enter result file: ')

with open (translit, 'r') as f:
	translit_list = f.read().splitlines()

#Задаем правила замены
en = 'abcdefghijklmnopqrstuvwxyz'
ru = 'абцдефгхийклмнопкрстуввхыз'
exp_list_translit = ['ch', 'sh', 'oo', 'ee', 'x', 'zh', 'ya', 'yu'] #правила замены для буквосочетаний
exp_list_rus =      ['ч',  'ш',  'у',  'и', 'кс', 'ж', 'я', 'ю']

def replace_incorrect_translit(russian):
    '''
    Заменяет ряд некорректных транслитов
    Вход: string из функции translit_to_russian()
    Выход: string с корректным транслитом
    '''
    #resultsList = resultsList.replace('', '')
    dict_replace = {'': ' ', ':': '', '\\': ' ', 'тоуран': 'туран', 'тоуарег': 'туарег', 'иарис': 'ярис', 'кипха': 'сифа', 'витз': 'витц', 'вангуард': 'вэнгард', 'хиэйс': 'хайс', 'тоуринг': 'туринг', 'товн': 'таун', 'секуоиа': 'секвойя', 'скептер': 'сцептер', 'трукк': 'трак', 'аке': 'эйс', 'лите': 'лайт', 'клугер': 'клюгер', 'хилух': 'хайлюкс', 'хигхлэндер': 'хайлендер', 'хиаке': 'хайс', 'гаиа': 'гайя', 'естима': 'эстима', 'ечо': 'эхо', 'дует': 'дуэт', 'кинос': 'цинос', 'кровн': 'краун', 'фиелдер': 'филдер', 'часер': 'чайзер', 'келсиор': 'цельсиор', 'гракиа': 'грация', 'бладе': 'блэйд', 'алпхард': 'альфард', 'ескудо': 'эскудо', 'оутбакк': 'аутбек', 'легаки': 'легаси', 'флуенке': 'флюенс', 'каиенне': 'кайен', 'порсче': 'порш', 'сунни': 'санни', 'пулсар': 'пульсар', 'кашкаи': 'кашкай', 'пресеа': 'пресия', 'праирие': 'прерия', 'патхфиндер': 'патфайндер', 'елгранд': 'эльгранд', 'силпхи': 'сильфи', 'блуебирд': 'блюберд', 'руннер': 'раннер', 'спаке': 'спэйс', 'оутлэндер': 'аутлендер', 'ланкер': 'лансер', 'емерауде': 'эмерауд', 'еклипсе': 'эклипс', 'диаманте': 'диамант', 'колт': 'кольт', 'чалленгер': 'челленджер', 'хедос': 'кседос', 'фриенди': 'френди', 'бравни': 'брауни', 'кебриум': 'себриум', 'евокуе': 'эвок', 'ранге': 'рендж', 'дисковери': 'дискавери', 'спортаге': 'спортаж', 'типе': 'тайп', 'даили': 'дейли', 'гемини': 'джемини', 'елф': 'эльф', 'старех': 'старекс', 'матрих': 'матрикс', 'грандеур': 'грандер', 'старех': 'старекс', 'ехкел': 'эксель', 'елантра': 'элантра', 'аккент': 'акцент', 'инспире': 'инспайр', 'инсигхт': 'инсайт', 'шуттле': 'шаттл', 'хибрид': 'гибрид', 'елисион': 'элизион', 'елемент': 'элемент', 'едих': 'эдикс', 'аирваве': 'эйрвэйв', 'деер': 'дир', 'валл': 'волл', 'емгранд': 'эмгранд', 'тоурнео': 'торнео', 'галахи': 'галакси', 'фусион': 'фьюжн', 'джоурнеи': 'джорни', 'есперо': 'эсперо', 'хсара': 'ксара', 'круисер': 'крузер', 'пакифика': 'пацифика', 'воиагер': 'вояджер', 'ескаладе': 'эскалейд', 'куаттро': 'куатро', 'шаанхи': 'шанкси', 'линколн': 'линкольн', 'ланд': 'ленд', 'джееп': 'джип', 'джагуар': 'ягуар', 'хаима': 'хайма', 'фреигхтлинер': 'фрейтлайнер', 'сериес': 'серия', 'алфа': 'альфа', 'чрислер': 'крайслер', 'хуммер': 'хаммер', 'волксваген': 'фольксваген', 'волво': 'вольво', 'тоиота': 'тойота', 'ссангионг': 'ссангйонг', 'скода': 'шкода', 'ренаулт': 'рено', 'пеугеот': 'пежо', 'опел': 'опель', 'митсубиши': 'мицубиси', 'бенз': 'бенц', 'меркедес': 'мерседес', 'лехус': 'лексус', 'хиундаи': 'хендай', 'чевролет': 'шевроле', 'даеву': 'дэу', 'додге': 'додж', 'даихатсу': 'дайхатсу', 'китроен': 'ситроен', 'геели': 'джили', 'опельь': 'опель'}
    if russian in dict_replace:
        russian = dict_replace[russian]
    return(russian)
#Транслитерация текста
def translit_to_russian():
    '''
    Переводит транслит на русский.
    Вход: список translit_list с вводами на транслите
    Выход: список russian_list с вводами на русском
    '''
    russian_list = []
    russian = ''
    for translit in translit_list:
        i = 0
        while i < len(translit):
            if i+1 < len(translit):
                print(str(i) + ' - ' + str(len(translit)))
                char = translit[i]
                exp = translit[i] + translit[i+1]
                if exp in exp_list_translit:
                    exp_pos = exp_list_translit.index(exp)
                    exp = exp_list_rus[exp_pos]
                    russian += exp
                    i += 2
                elif char in exp_list_translit:
                    char_pos = exp_list_translit.index(char)
                    char = exp_list_rus[char_pos]
                    russian += char
                    i += 1
                elif char in en:
                    char_pos = en.find(char)
                    char = ru[char_pos]
                    russian += char
                    i += 1
                else:
                    russian += char
                    i += 1
            else:
                char = translit[i]
                if char in exp_list_translit:
                    char_pos = exp_list_translit.index(char)
                    char = exp_list_rus[char_pos]
                    russian += char
                    i += 1
                elif char in en:
                    char_pos = en.find(char)
                    char = ru[char_pos]
                    russian += char
                    i += 1
                else:
                    russian += char
                    i += 1
        russian = replace_incorrect_translit(russian)
        russian_list.append(russian)
        russian = ''
    return(russian_list)

russian_list = translit_to_russian()

with open(result, 'w') as f:
    for line in russian_list:
        f.write(line + '\n')
print ('I\'ve done your dirty wish, old bastard')
